# -*- coding: utf-8 -*-
"""лаба 3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/19_d-4f2do4kHnVF8OIN3-mwNlIX-aJ_o
"""

#calendar
print("Введите номер месяца")
a=int(input())
if a==1:
 print("Январь")
if a==2:
 print("Февраль")
if a==3:
 print("Март")
if a==4:
 print("Апрель")
if a==5:
 print("Май")
if a==6:
 print("Июнь")
if a==7:
 print("Июль")
if a==8:
 print("Август")
if a==9:
 print("Сентябрь")
if a==10:
 print("Октябрь")
if a==11:
 print("Ноябрь")
if a==12:
 print("Декабрь")

#Чётное\нечётное.
print("Введите число")
a=int(input())
if a%2==0:
  print("Четное")
else:
  print("Нечетное")

#Дано число N, если оно больше 40, выведите “stonks”, если меньше 40,
#выведите “not stonks”
print("Введите число")
a=int(input())
if a>40:
  print("stonks")
else:
  print("not stonks")

#Написать функцию is_year_leap, принимающую 1 аргумент — год, и
#возвращающую True, если год високосный, и False иначе
print("Введите число")
is_year_leap=int(input())
if is_year_leap%4>0:
  print("False")
elif(is_year_leap%10==0)and (is_year_leap%100==0)and(is_year_leap%400>0):
  print("False")
else:
  print("True")

#Написать функцию is_prime, принимающую 1 аргумент — число n,
#которое задаётся пользователем, и возвращающую True, если оно
#простое, и False - иначе.
print("Введите число")
k=int()
is_prime=int(input())
for i in range(1,is_prime):
 if is_prime%i==0:
  k=k+1
if k>2:
  print("False")
else:
  print("True")

#Поменяйте значения переменных местами в том случае, если значение
#первой переменной больше значения второй в 3.6 раза, либо значение
#второй находится в промежутке [(-138/2)^1.3 ; |(-69/28^5.1)*4|].
print("Введите 2 числa")
a=float(input())
b=float(input())
c=float()
if a>b*3.6:
  с=b
  b=a
  a=b
  print(a, b)
elif abs((-138/2)**1.3)<=abs(b)<=abs((-69/28**5.1)**4):
  с=b
  b=a
  a=b
  print(a, b)
else:
  print("ne te chisla")

6

#Пользователь вводит 5 чисел, необходимо проверить являются ли они
#все уникальными и посчитать количество четных, отрицательных, а так
#же лежащих в промежутке [-256 ; 1024].
print("Введите чисlo")
cht =0
otr=0
prom=0
a=[]
for i in range(5):
  a.append(int(input()))
  if a[i]<0:
    otr+=1
  if a[i]%2==0:
    cht+=1
  if -256<=a[i]<=1024:
    prom+=1
print(otr, cht)
print(len(set(a)))

a=int(input())
b=int(input())
c=int(input())
f=((a**2+b**3)/(c+3))/4
if f%2==0:
  print(f,'chetnoe')
elif f%2==1:
  print(f,'nechetnoe')
else:
  print(f,'drobnoe')